       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVIEWCASE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-AREA.
       05 ITEM-TARGET PIC X(8) OCCURS 2
        VALUE 'PROGA001'.
       88 IS-PROGA VALUE 'PROGA001'.
       PROCEDURE DIVISION.
       CALL ITEM-TARGET(1).
       GOBACK.
