       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-AREA.
       05 OUTER-ROW OCCURS 2.
       10 ITEM-TARGET PIC X(8) OCCURS 2 VALUE 'PROGA001'.
       PROCEDURE DIVISION.
       CALL ITEM-TARGET(1, 2).
       GOBACK.
