       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-AREA.
       05 ROWS-DATA.
       10 FIRST-NAME PIC X(8) VALUE 'PROGA001'.
       10 SECOND-NAME PIC X(8) VALUE 'PROGB001'.
       05 ROWS REDEFINES ROWS-DATA.
       10 ITEM-TARGET PIC X(8) OCCURS 2.
       PROCEDURE DIVISION.
       MOVE 'PROGC001' TO ITEM-TARGET(1).
       CALL FIRST-NAME.
       GOBACK.
