       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEMS.
       05 INITIAL-ROWS.
       10 FILLER PIC 9(2) VALUE 1.
       10 FILLER PIC X(8) VALUE 'NOTPROG1'.
       10 FILLER PIC X(8) VALUE 'PROGA001'.
       10 FILLER PIC 9(2) VALUE 2.
       10 FILLER PIC X(8) VALUE 'NOTPROG2'.
       10 FILLER PIC X(8) VALUE 'PROGB001'.
       05 ROWS REDEFINES INITIAL-ROWS.
       10 ITEM-ROW OCCURS 3.
       15 ITEM-NUM PIC 9(2).
       15 ITEM-DESC PIC X(8).
       15 ITEM-TARGET PIC X(8).
       01 CHOICE-NUM PIC 9.
       PROCEDURE DIVISION.
       MOVE '99NOTPROG3PROGC001' TO ITEM-ROW(1).
       CALL ITEM-TARGET(1).
       GOBACK.
