       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AREA.
       05 PREFIX-PART PIC X(2).
       05 RAW-PART PIC X(4).
       05 FILLER REDEFINES RAW-PART.
       10 WS-PGM PIC X(8).
       05 TAIL-PART PIC X(2).
       PROCEDURE DIVISION.
       MOVE '++PGM00001TT' TO WS-AREA.
       CALL WS-PGM.
       GOBACK.
