       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RAW-AREA PIC X(8).
       01 WS-PGM REDEFINES RAW-AREA PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PGM00001' TO WS-PGM.
       CALL RAW-AREA.
       GOBACK.
