       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RAW-AREA PIC X(4).
       01 WIDE-AREA REDEFINES RAW-AREA PIC X(8).
       01 SHORT-AREA REDEFINES WIDE-AREA PIC X(6).
       PROCEDURE DIVISION.
       MOVE 'PGM00001' TO WIDE-AREA.
       CALL RAW-AREA.
       GOBACK.
