       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SQL-TEXT PIC X(32).
       PROCEDURE DIVISION.
           EXEC SQL PREPARE S FROM :SQL-TEXT END-EXEC
           EXEC SQL EXECUTE S END-EXEC
           CALL 'AFTERSQL'
           GOBACK.
