IDENTIFICATION DIVISION.
PROGRAM-ID. CALLER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC X(8).
01 WS-PGM PIC X(8).
PROCEDURE DIVISION.
MAIN.
PERFORM DEFINE-PGM.
CALL WS-PGM.
GOBACK.
DEFINE-PGM.
MOVE 'PROGA' TO WS-A.
MOVE WS-A TO WS-PGM.
