IDENTIFICATION DIVISION.
PROGRAM-ID. CALLER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
PROCEDURE DIVISION.
MAIN.
MOVE 'OLDPROG' TO WS-PGM.
PERFORM DEFINE-PGM.
CALL WS-PGM.
GOBACK.
DEFINE-PGM.
MOVE 'PROGA' TO WS-PGM.
