       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE CONDITION PGMIDERR(ERR-P)
        END-EXEC.
       GO TO SEND-P.
       RETRY-P.
       EXEC CICS XCTL PROGRAM('TARGET')
         END-EXEC.
       GOBACK.
       SEND-P.
       EXEC CICS XCTL PROGRAM('TARGET')
         END-EXEC.
       GOBACK.
       ERR-P.
       CALL 'HANDLER'.
       GO TO RETRY-P.
