       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       EXEC CICS IGNORE CONDITION ERROR END-EXEC.
       EXEC CICS XCTL PROGRAM('TARGET')
         END-EXEC.
       CALL 'AFTER'.
       GOBACK.
