       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE CONDITION PGMIDERR(ERR-P)
        END-EXEC.
       GO TO RUN-P.
       UNUSED-P.
       EXEC CICS PUSH HANDLE END-EXEC.
       EXEC CICS HANDLE CONDITION PGMIDERR(NEW-P) END-EXEC.
       EXEC CICS POP HANDLE END-EXEC.
       RUN-P.
       EXEC CICS XCTL PROGRAM('TARGET')
         END-EXEC.
       CALL 'AFTER'.
       GOBACK.
       ERR-P.
       CALL 'HANDLER'.
       GOBACK.
       NEW-P.
       CALL 'NEWHAND'.
       GOBACK.
