       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE CONDITION ERROR(GEN-P)
        END-EXEC.
       EXEC CICS LINK PROGRAM('TARGET')
         END-EXEC.
       CALL 'AFTER'.
       GOBACK.
       GEN-P.
       CALL 'GENERAL'.
       GOBACK.
