       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE CONDITION PGMIDERR(ERR-P)
        END-EXEC.
       EXEC CICS XCTL PROGRAM('TARGET')
         END-EXEC.
       GOBACK.
       ENTRY 'ALTPOINT'.
       EXEC CICS LINK PROGRAM('TARGET')
         END-EXEC.
       CALL 'AFTER'.
       GOBACK.
       ERR-P.
       CALL 'HANDLER'.
       GOBACK.
