       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVIEWCASE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE CONDITION PGMIDERR(OLD-H) END-EXEC.
       EXEC CICS PUSH HANDLE END-EXEC.
       EXEC CICS POP HANDLE END-EXEC.
       IF RESPONSE-CODE = 1
       EXEC CICS HANDLE CONDITION PGMIDERR(NEW-H) END-EXEC
       END-IF.
       EXEC CICS LINK PROGRAM('TARGET') END-EXEC.
       GOBACK.
       OLD-H.
       CALL 'OLDPROG'.
       GOBACK.
       NEW-H.
       CALL 'NEWPROG'.
       GOBACK.
