       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVIEWCASE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPONSE-CODE PIC S9(9) COMP.
       PROCEDURE DIVISION.
       GO TO SETUP-P.
       EVENT-P.
       EXEC CICS LINK PROGRAM('TARGET') END-EXEC.
       GOBACK.
       SETUP-P.
       EXEC CICS HANDLE CONDITION PGMIDERR(OLD-H) END-EXEC.
       EXEC CICS PUSH HANDLE END-EXEC.
       EXEC CICS POP HANDLE END-EXEC.
       GO TO EVENT-P.
       OLD-H.
       CALL 'OLDPROG'.
       GOBACK.
       NEW-H.
       CALL 'NEWPROG'.
       GOBACK.
