       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONDITION-UNLOCATED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DUMMY-A PIC X.
       LINKAGE SECTION.
       01 ARGUMENT-A PIC X.
          88 READY-A VALUE 'Y'.
       PROCEDURE DIVISION.
           SET READY-A TO TRUE
           IF READY-A
              CALL 'PROGA'
           END-IF
           GOBACK.
       END PROGRAM CONDITION-UNLOCATED.
