       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMERIC-CONVERSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SOURCE-A PIC S9(4)V99.
       01 TARGET-A PIC 99.
       01 TARGET-B PIC S9(3)V9 COMP-3.
       01 BINARY-A PIC S9(4) COMP.
       01 NATIVE-A PIC S9(4) COMP-5.
       01 NATIVE-U PIC 99 COMP-5.
       01 SCALE-A PIC 99PP.
       PROCEDURE DIVISION.
           MOVE -123.459 TO SOURCE-A
           MOVE SOURCE-A TO TARGET-A TARGET-B
           MOVE -123 TO BINARY-A
           MOVE 123451 TO NATIVE-A
           MOVE NATIVE-A TO TARGET-B
           MOVE -65537 TO NATIVE-U
           MOVE NATIVE-U TO NATIVE-U
           MOVE 12345 TO SCALE-A
           MOVE SCALE-A TO TARGET-B
           MOVE '00052' TO SOURCE-A
           MOVE '052' TO TARGET-A
           GOBACK.
