       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TS PIC X(21).
       01 TARGET-NAME PIC X(8) VALUE 'PROGA001'.
       PROCEDURE DIVISION.
           MOVE FUNCTION CURRENT-DATE TO TS
           CALL TARGET-NAME
           GOBACK.
