       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(5).
       PROCEDURE DIVISION.
           MOVE 'PROGA' TO WS-PGM.
           CALL WS-PGM.
           GOBACK.
