       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
           EVALUATE TRUE WHEN OTHER CONTINUE END-EVALUATE.
           CALL WS-PGM.
           GOBACK.
