       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
           IF WS-PGM = 'PROGA' CONTINUE END-IF.
           CALL WS-PGM.
           GOBACK.
