       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       COPY MISSINGCPY.
       PROCEDURE DIVISION.
           CALL WS-PGM.
           GOBACK.
