       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
           PERFORM 1 TIMES CONTINUE END-PERFORM.
           CALL WS-PGM.
           GOBACK.
