       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
           CALL WS-PGM(1:5).
           GOBACK.
