       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDRESSES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ROWS-A.
         05 ROW-A PIC X OCCURS 4.
       01 INDEX-A PIC 9 VALUE 1.
       01 FLAG-A PIC X VALUE 'Y'.
       PROCEDURE DIVISION.
       IF ROW-A(INDEX-A) = FLAG-A
           CALL 'ADDRESS-POSSIBLE'
       END-IF.
       GOBACK.
