       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOOL-PREDICATES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-A PIC X(8) VALUE 'OLD'.
       PROCEDURE DIVISION.
       EVALUATE TRUE
       WHEN TRUE
           CALL 'PROGA'
           MOVE 'PROGA' TO TARGET-A
       WHEN FALSE
           CALL 'PROGB'
           MOVE 'PROGB' TO TARGET-A
       WHEN OTHER
           MOVE 'OTHER' TO TARGET-A
       END-EVALUATE.
       CALL TARGET-A.
       GOBACK.
