       identification division.
       program-id. SENDPROBE.
       data division.
       working-storage section.
       01 WS-DATA PIC X(16).
       01 N PIC S9(4) COMP.
       01 CONV PIC X(4).
       procedure division.
           COPY R7BSEND.
           COPY R7BSEND.
           GOBACK.
