IDENTIFICATION DIVISION.
PROGRAM-ID. FAMILY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
PROCEDURE DIVISION.
MAIN.
PERFORM A.
CALL WS-PGM.
GOBACK.
A.
CONTINUE.
