       IDENTIFICATION DIVISION.
       PROGRAM-ID. GROUP-CHILD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AREA.
          05 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PGM00001' TO WS-AREA.
       CALL WS-PGM.
       GOBACK.
