       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENTRYGAP.
       PROCEDURE DIVISION.
       MAIN.
           CALL 'KEEPPGM'
           GOBACK
       LATER.
           CALL 'LATERPGM'
           GOBACK.
