       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIAS-12.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-TARGET PIC X(8).
          05 WS-ALIAS REDEFINES WS-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'PROGA001TAIL' TO WS-ALIAS
       CALL WS-TARGET
       GOBACK.
