       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-ADVERSARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8).
       01 FLAG PIC X.
       01 I PIC 9(4).
       01 J PIC 9(4).
       01 K PIC 9(4).
       01 N PIC 9(4).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'LIVE0001' TO PGM
       EXIT PERFORM
       CALL PGM
       PERFORM P
       CALL PGM
       GOBACK.
       P.
       MOVE 'LIVE0002' TO PGM
       EXIT PERFORM.
