       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTEGER-TEXT-CHECKPOINT IS INITIAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SOURCE-A PIC S9(5) COMP-3.
       01 BINARY-A PIC S9(4) COMP.
       01 NATIVE-A PIC S9(4) COMP-5.
       01 NATIVE-B PIC S99 COMP-5.
       01 SCALE-A PIC 99PP.
       01 MIXED-RECORD.
          05 TEXT-A PIC X(8).
          05 TEXT-B PIC X(3).
          05 NUMBER-A PIC 99 COMP-3.
       PROCEDURE DIVISION.
           MOVE -23 TO SOURCE-A
           MOVE SOURCE-A TO TEXT-A
           MOVE SOURCE-A TO TEXT-B
           MOVE 2345 TO SCALE-A
           MOVE SCALE-A TO TEXT-A
           MOVE 12 TO BINARY-A
           MOVE BINARY-A TO TEXT-A
           MOVE 12 TO NATIVE-A
           MOVE NATIVE-A TO TEXT-A
           MOVE 123451 TO NATIVE-B
           MOVE NATIVE-B TO TEXT-A
           MOVE -00052 TO TEXT-A
           MOVE +005 TO TEXT-A
           MOVE 0 TO TEXT-A
           MOVE -00052 TO SOURCE-A
           GOBACK.
