       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMERIC-CHECKPOINT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTS.
          05 COUNT-A PIC 99 VALUE 12.
          05 COUNT-B PIC 9(4).
       01 COUNT-C PIC 9(5).
       PROCEDURE DIVISION.
           MOVE 12 TO COUNT-A
           MOVE COUNT-A OF COUNTS TO COUNT-B COUNT-C
           MOVE ZEROS TO COUNT-A COUNT-B
           GOBACK.
