       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMERIC-MIXED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNT-A PIC 99.
       01 COUNT-B PIC 99.
       01 TEXT-A PIC XX.
       PROCEDURE DIVISION.
           MOVE 12 TO COUNT-A
           MOVE COUNT-A TO COUNT-B TEXT-A COUNT-A
           GOBACK.
