       IDENTIFICATION DIVISION.
       PROGRAM-ID. POSPUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY LOCAL.
       01 RC PIC S9(8) COMP.
       01 RC2 PIC S9(8) COMP.
       01 POST-PGM PIC X(8).
       PROCEDURE DIVISION.
           CALL 'BEFORE'.
           GO TO FINISH.
       DEAD-PARA.
           EXEC CICS SYNCPOINT NOHANDLE END-EXEC.
       FINISH.
           MOVE 'AFTER' TO POST-PGM.
           CALL POST-PGM.
           GOBACK.
