       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MQTM PIC X(684).
       PROCEDURE DIVISION.
           EXEC CICS RETRIEVE INTO(MQTM) NOHANDLE END-EXEC
           CALL 'AFTERIO'
           GOBACK.
