       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET PIC X(8).
       01 ARG PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PRIMARY' TO TARGET.
       CALL TARGET.
       GOBACK.
       ENTRY 'ALTPOINT'.
       MOVE 'ALTBODY' TO TARGET.
       CALL TARGET.
       GOBACK.
