       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       CALL 'BEFORE'.
       ENTRY 'ALTPOINT'.
       CALL 'AFTER'.
       GOBACK.
