       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 ARG PIC X(8).
       PROCEDURE DIVISION.
       GOBACK.
       ENTRY 'ALTPOINT' USING ARG.
       CALL ARG.
       GOBACK.
