       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R.
        02 A PIC X(8).
        02 B REDEFINES A PIC X(4).
       WORKING-STORAGE SECTION.
       01 BUF PIC X(8).
       PROCEDURE DIVISION.
       GOBACK.
