       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHARESTA.
       PROCEDURE DIVISION.
           EXEC CICS HANDLE ABEND LABEL(HANDLER-A) END-EXEC.
           PERFORM ROUTINE-A.
           EXEC CICS HANDLE ABEND LABEL(HANDLER-B) END-EXEC.
           PERFORM ROUTINE-A.
           EXEC CICS LINK PROGRAM('AFTERPGM') END-EXEC.
           GOBACK.
       ROUTINE-A.
           CONTINUE.
       HANDLER-A.
           CALL 'OLDPROG'.
           GOBACK.
       HANDLER-B.
           CALL 'NEWPROG'.
           GOBACK.
