       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOUNDED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       01 RESPONSE-CODE PIC S9(8) COMP.
       01 DATA-AREA PIC X(80).
       PROCEDURE DIVISION.
           EXEC CICS HANDLE ABEND CANCEL END-EXEC
           EXEC CICS READ FILE('FILE0001')
                INTO(DATA-AREA) RIDFLD(TARGET-NAME) NOHANDLE
           END-EXEC
           PERFORM P
           CALL 'FIRST001'
           PERFORM P
           CALL 'SECOND01'
           EXEC CICS ABEND END-EXEC
           GOBACK.
       P.
           EXEC CICS XCTL PROGRAM('DEST0001') NOHANDLE END-EXEC.
       TAIL-P.
           CALL 'DEAD0001'
           GOBACK.
