       IDENTIFICATION DIVISION.
       PROGRAM-ID. GOTOADJACENCY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X.
       01 WS-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
           MOVE 'PROGA001' TO WS-TARGET
           GO TO P-CALL
           MOVE 'BADPGM01' TO WS-TARGET
           CALL WS-TARGET
           GOBACK.
       P-CALL.
           CALL WS-TARGET
           GOBACK.
