       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEGACYORDINARYINCOMINGDEAD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X.
       01 WS-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
           PERFORM P
           CALL WS-TARGET
           GOBACK.
       DEAD.
           MOVE 'BADPGM01' TO WS-TARGET.
       P.
           MOVE 'PROGB001' TO WS-TARGET.
