       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORDINARYBASE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X.
       01 WS-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
           MOVE 'PROGA001' TO WS-TARGET
           .
       P-CALL.
           CALL WS-TARGET
           GOBACK.
