       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFGOTOFANOUT40.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X.
       01 WS-TARGET PIC X(8).
       01 WS-N PIC 9(2).
       PROCEDURE DIVISION.
       MAIN.
           GO TO
               P-0
               P-1
               P-2
               P-3
               P-4
               P-5
               P-6
               P-7
               P-8
               P-9
               P-10
               P-11
               P-12
               P-13
               P-14
               P-15
               P-16
               P-17
               P-18
               P-19
               P-20
               P-21
               P-22
               P-23
               P-24
               P-25
               P-26
               P-27
               P-28
               P-29
               P-30
               P-31
               P-32
               P-33
               P-34
               P-35
               P-36
               P-37
               P-38
               P-39
               DEPENDING ON WS-N
           GOBACK.
       P-0.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-1.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-2.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-3.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-4.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-5.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-6.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-7.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-8.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-9.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-10.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-11.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-12.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-13.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-14.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-15.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-16.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-17.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-18.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-19.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-20.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-21.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-22.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-23.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-24.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-25.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-26.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-27.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-28.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-29.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-30.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-31.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-32.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-33.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-34.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-35.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-36.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-37.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-38.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-39.
           MOVE 'PROGB001' TO WS-TARGET
           GO TO P-CALL.
       P-CALL.
           CALL WS-TARGET
           GOBACK.
