       IDENTIFICATION DIVISION.
       PROGRAM-ID. LWFILL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 MESSAGE-TEXT PIC X(4) VALUE 'TEST'.
       PROCEDURE DIVISION.
           GOBACK.
