       IDENTIFICATION DIVISION.
       PROGRAM-ID. LWFILL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MSG-GROUP.
          05 MESSAGE-TEXT PIC X(8) VALUE 'PROGA001'.
       PROCEDURE DIVISION.
           CALL MESSAGE-TEXT.
           GOBACK.
