       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 INNER-REC.
             10 RAW-TARGET PIC X(8) VALUE 'PROGA001'.
             10 ALIAS-TARGET REDEFINES RAW-TARGET PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PROGB001' TO INNER-REC.
       CALL ALIAS-TARGET.
       GOBACK.
