       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 TARGET PIC X(8) VALUE 'PROGA001'.
       PROCEDURE DIVISION.
       PERFORM UPDATE-TARGET.
       CALL TARGET.
       PERFORM UPDATE-TARGET.
       CALL TARGET.
       GOBACK.
       UPDATE-TARGET.
       MOVE 'PROGB001' TO TARGET.
