       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 TARGET PIC X(8) VALUE 'PROGA001'.
       01 FILLER.
          05 OTHER-TARGET PIC X(8) VALUE 'PROGB001'.
       PROCEDURE DIVISION.
       MOVE 'PROGC001' TO TARGET.
       CALL TARGET.
       CALL OTHER-TARGET.
       GOBACK.
