       IDENTIFICATION DIVISION.
       PROGRAM-ID. STATECASE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FLAG PIC 9.
       01 PGM PIC X(8).
       PROCEDURE DIVISION.
       MAIN-P.
           EXEC CICS HANDLE ABEND LABEL(A) END-EXEC
           EXEC CICS HANDLE ABEND CANCEL END-EXEC
           EXEC CICS ABEND END-EXEC.
       A.
           GOBACK.
       B.
           GOBACK.
       C.
           GOBACK.
