       CBL TRUNC(STD)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRUNC-VALUES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SOURCE-A PIC 9(6).
       01 TARGET-A PIC S99 COMP.
       PROCEDURE DIVISION.
           MOVE 123451 TO SOURCE-A.
           MOVE SOURCE-A TO TARGET-A.
           MOVE 123451 TO TARGET-A.
           GOBACK.
