       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVI-CALL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LIT-PGM PIC X(8) VALUE 'PROGA'.
       PROCEDURE DIVISION.
           CALL LIT-PGM.
           GOBACK.
