       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTABCODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8) VALUE "EXITPGM".
       PROCEDURE DIVISION.
       MAIN-P.
           EXEC CICS ABEND ABCODE('9999') END-EXEC
           GOBACK.
       ERR.
           GOBACK.
