       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTABEND.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8) VALUE "EXITPGM".
       PROCEDURE DIVISION.
       MAIN-P.
           EXEC CICS ABEND END-EXEC
           GOBACK.
       ERR.
           GOBACK.
