       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTLITERAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8) VALUE "EXITPGM".
       PROCEDURE DIVISION.
       MAIN-P.
           EXEC CICS HANDLE ABEND PROGRAM('X') END-EXEC
           GOBACK.
       ERR.
           GOBACK.
