       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORACLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           IF TARGET-NAME = 'TEST0001'
               MOVE 'FIRST001' TO TARGET-NAME
               EXEC CICS XCTL PROGRAM(TARGET-NAME) END-EXEC
           ELSE
               MOVE 'SECOND01' TO TARGET-NAME
               EXEC CICS XCTL PROGRAM(TARGET-NAME) END-EXEC
           END-IF
           GOBACK.
