       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORACLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           PERFORM TRANSFER-PARA
           PERFORM TRANSFER-PARA
           GOBACK.
       TRANSFER-PARA.
           MOVE 'BEFORE01' TO TARGET-NAME
           EXEC CICS XCTL PROGRAM(TARGET-NAME) END-EXEC.
