       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORACLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           GO TO LIVE-PARA.
       DEAD-PARA.
           EXEC CICS XCTL PROGRAM('DEAD0001') END-EXEC.
       LIVE-PARA.
           EXEC CICS XCTL PROGRAM('LIVE0001') END-EXEC.
