       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORACLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8) VALUE 'OLD00001'.
       PROCEDURE DIVISION.
           MOVE 'NEW00001' TO TARGET-NAME
           EXEC CICS XCTL PROGRAM(TARGET-NAME) END-EXEC.
