       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORACLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           CALL 'CALL0001'
           EXEC CICS LINK PROGRAM('LINK0001') NOHANDLE END-EXEC
           EXEC CICS XCTL PROGRAM('XCTL0001') NOHANDLE END-EXEC
           CALL 'AFTER001'
           GOBACK.
