       IDENTIFICATION DIVISION.
       PROGRAM-ID. JUNITB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           MOVE 'UNITB001' TO TARGET-NAME
           EXEC CICS XCTL PROGRAM(TARGET-NAME) END-EXEC.
