       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MAP-NAME PIC X(8).
       01 WS-AREA PIC X(80).
       01 RC PIC S9(8) COMP.
       01 RC2 PIC S9(8) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE ABEND LABEL(ERR) END-EXEC.
       EXEC CICS SYNCPOINT NOHANDLE END-EXEC.
       EXEC CICS SYNCPOINT NOHANDLE END-EXEC.

       EXEC CICS ABEND END-EXEC.
       ERR.
       GOBACK.
