       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FLAG PIC X.
       01 PGM PIC X(8) VALUE 'FAKEPGM'.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE ABEND LABEL(ERR) END-EXEC.
       IF FLAG = 'Y'
           GO TO ERR
       END-IF.
       EXEC CICS XCTL PROGRAM('X') END-EXEC.
       GOBACK.
       ERR.
       CALL 'BOTH'.
       GOBACK.
