       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RC PIC S9(8) COMP.
       PROCEDURE DIVISION.
       CALL 'KEEPPGM'.
       EXEC CICS SEND TEXT FROM(RC) END-EXEC.
       GOBACK.
