       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FLAG PIC X.
       01 PGM PIC X(8) VALUE 'FAKEPGM'.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE ABEND LABEL(OLD-H) END-EXEC.
       EXEC CICS HANDLE ABEND LABEL(NEW-H) END-EXEC.
       EXEC CICS ABEND END-EXEC.
       OLD-H.
       CALL 'OLDPGM'.
       GOBACK.
       NEW-H.
       CALL 'NEWPGM'.
       GOBACK.
