       IDENTIFICATION DIVISION.
       PROGRAM-ID. W6R1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TARGET PIC X(8).
       01 WS-DUMMY PIC X(8).
       01 WS-FLAG PIC X.
       01 WS-COUNT PIC 9(4).
       01 WS-RESP PIC S9(8) COMP.
       PROCEDURE DIVISION.
       MAIN.
           MOVE 'PROGA001' TO WS-TARGET
           PERFORM P 0 TIMES
           CALL WS-TARGET
           GOBACK.
       P.
           MOVE 'PROGB001' TO WS-TARGET.
