       IDENTIFICATION DIVISION.
       PROGRAM-ID. W6PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TARGET PIC X(8).
       01 WS-DUMMY PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
           MOVE 'PROGA001' TO WS-TARGET
           PERFORM P THRU P-END
           CALL WS-TARGET
           GOBACK.
       P.
           MOVE 'PROGB001' TO WS-TARGET.
       P-END.
           EXIT PARAGRAPH.
