       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANONYMOUS-VIEW.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       01 FILLER REDEFINES TARGET-NAME PIC X(8).
       PROCEDURE DIVISION.
           MOVE 'KEEP0001' TO TARGET-NAME.
           CALL TARGET-NAME.
           MOVE 'NEXT0001' TO TARGET-NAME.
           CALL TARGET-NAME.
           GOBACK.
