       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL-IO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INDD FILE STATUS FS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       01 SRC PIC X(8).
       01 FS PIC XX.
       PROCEDURE DIVISION.
       MOVE 'KEEP0001' TO TARGET-NAME.
       MOVE 'SAFE0001' TO SRC.
       READ F.
       CALL TARGET-NAME.
       MOVE 'NEXT0001' TO TARGET-NAME.
       CALL TARGET-NAME.
       CALL SRC.
       GOBACK.
