       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOUNDED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8).
       01 RESPONSE-CODE PIC S9(8) COMP.
       01 DATA-AREA PIC X(80).
       PROCEDURE DIVISION.
           EXEC CICS XCTL PROGRAM('SAME0001') NOHANDLE END-EXEC
           EXEC CICS XCTL PROGRAM('SAME0001') NOHANDLE END-EXEC
           CALL 'AFTER001'
           GOBACK.
