       IDENTIFICATION DIVISION.
       PROGRAM-ID. SCALE-PRODUCTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-0 PIC X(5).
       01 WS-1 PIC X(5).
       01 WS-2 PIC X(5).
       01 WS-3 PIC X(5).
       01 WS-4 PIC X(5).
       01 WS-5 PIC X(5).
       01 WS-6 PIC X(5).
       01 WS-7 PIC X(5).
       01 WS-8 PIC X(5).
       01 WS-9 PIC X(5).
       01 WS-10 PIC X(5).
       01 WS-11 PIC X(5).
       01 WS-12 PIC X(5).
       01 WS-13 PIC X(5).
       01 WS-14 PIC X(5).
       01 WS-15 PIC X(5).
       01 WS-16 PIC X(5).
       01 WS-17 PIC X(5).
       01 WS-18 PIC X(5).
       01 WS-19 PIC X(5).
       01 WS-20 PIC X(5).
       01 WS-21 PIC X(5).
       01 WS-22 PIC X(5).
       01 WS-23 PIC X(5).
       01 WS-24 PIC X(5).
       01 WS-25 PIC X(5).
       01 WS-26 PIC X(5).
       01 WS-27 PIC X(5).
       01 WS-28 PIC X(5).
       01 WS-29 PIC X(5).
       01 WS-30 PIC X(5).
       01 WS-31 PIC X(5).
       01 WS-32 PIC X(5).
       01 WS-33 PIC X(5).
       01 WS-34 PIC X(5).
       01 WS-35 PIC X(5).
       01 WS-36 PIC X(5).
       01 WS-37 PIC X(5).
       01 WS-38 PIC X(5).
       01 WS-39 PIC X(5).
       01 WS-40 PIC X(5).
       01 WS-41 PIC X(5).
       01 WS-42 PIC X(5).
       01 WS-43 PIC X(5).
       01 WS-44 PIC X(5).
       01 WS-45 PIC X(5).
       01 WS-46 PIC X(5).
       01 WS-47 PIC X(5).
       01 WS-48 PIC X(5).
       01 WS-49 PIC X(5).
       01 WS-50 PIC X(5).
       01 WS-51 PIC X(5).
       01 WS-52 PIC X(5).
       01 WS-53 PIC X(5).
       01 WS-54 PIC X(5).
       01 WS-55 PIC X(5).
       01 WS-56 PIC X(5).
       01 WS-57 PIC X(5).
       01 WS-58 PIC X(5).
       01 WS-59 PIC X(5).
       01 WS-60 PIC X(5).
       01 WS-61 PIC X(5).
       01 WS-62 PIC X(5).
       01 WS-63 PIC X(5).
       01 WS-64 PIC X(5).
       01 WS-65 PIC X(5).
       01 WS-66 PIC X(5).
       01 WS-67 PIC X(5).
       01 WS-68 PIC X(5).
       01 WS-69 PIC X(5).
       01 WS-70 PIC X(5).
       01 WS-71 PIC X(5).
       01 WS-72 PIC X(5).
       01 WS-73 PIC X(5).
       01 WS-74 PIC X(5).
       01 WS-75 PIC X(5).
       01 WS-76 PIC X(5).
       01 WS-77 PIC X(5).
       01 WS-78 PIC X(5).
       01 WS-79 PIC X(5).
       01 WS-80 PIC X(5).
       01 WS-81 PIC X(5).
       01 WS-82 PIC X(5).
       01 WS-83 PIC X(5).
       01 WS-84 PIC X(5).
       01 WS-85 PIC X(5).
       01 WS-86 PIC X(5).
       01 WS-87 PIC X(5).
       01 WS-88 PIC X(5).
       01 WS-89 PIC X(5).
       01 WS-90 PIC X(5).
       01 WS-91 PIC X(5).
       01 WS-92 PIC X(5).
       01 WS-93 PIC X(5).
       01 WS-94 PIC X(5).
       01 WS-95 PIC X(5).
       01 WS-96 PIC X(5).
       01 WS-97 PIC X(5).
       01 WS-98 PIC X(5).
       01 WS-99 PIC X(5).
       01 WS-100 PIC X(5).
       01 WS-101 PIC X(5).
       01 WS-102 PIC X(5).
       01 WS-103 PIC X(5).
       01 WS-104 PIC X(5).
       01 WS-105 PIC X(5).
       01 WS-106 PIC X(5).
       01 WS-107 PIC X(5).
       01 WS-108 PIC X(5).
       01 WS-109 PIC X(5).
       01 WS-110 PIC X(5).
       01 WS-111 PIC X(5).
       01 WS-112 PIC X(5).
       01 WS-113 PIC X(5).
       01 WS-114 PIC X(5).
       01 WS-115 PIC X(5).
       01 WS-116 PIC X(5).
       01 WS-117 PIC X(5).
       01 WS-118 PIC X(5).
       01 WS-119 PIC X(5).
       01 WS-120 PIC X(5).
       01 WS-121 PIC X(5).
       01 WS-122 PIC X(5).
       01 WS-123 PIC X(5).
       01 WS-124 PIC X(5).
       01 WS-125 PIC X(5).
       01 WS-126 PIC X(5).
       01 WS-127 PIC X(5).
       01 WS-128 PIC X(5).
       01 WS-129 PIC X(5).
       01 WS-130 PIC X(5).
       01 WS-131 PIC X(5).
       01 WS-132 PIC X(5).
       01 WS-133 PIC X(5).
       01 WS-134 PIC X(5).
       01 WS-135 PIC X(5).
       01 WS-136 PIC X(5).
       01 WS-137 PIC X(5).
       01 WS-138 PIC X(5).
       01 WS-139 PIC X(5).
       01 WS-140 PIC X(5).
       01 WS-141 PIC X(5).
       01 WS-142 PIC X(5).
       01 WS-143 PIC X(5).
       01 WS-144 PIC X(5).
       01 WS-145 PIC X(5).
       01 WS-146 PIC X(5).
       01 WS-147 PIC X(5).
       01 WS-148 PIC X(5).
       01 WS-149 PIC X(5).
       01 WS-150 PIC X(5).
       01 WS-151 PIC X(5).
       01 WS-152 PIC X(5).
       01 WS-153 PIC X(5).
       01 WS-154 PIC X(5).
       01 WS-155 PIC X(5).
       01 WS-156 PIC X(5).
       01 WS-157 PIC X(5).
       01 WS-158 PIC X(5).
       01 WS-159 PIC X(5).
       01 WS-160 PIC X(5).
       01 WS-161 PIC X(5).
       01 WS-162 PIC X(5).
       01 WS-163 PIC X(5).
       01 WS-164 PIC X(5).
       01 WS-165 PIC X(5).
       01 WS-166 PIC X(5).
       01 WS-167 PIC X(5).
       01 WS-168 PIC X(5).
       01 WS-169 PIC X(5).
       01 WS-170 PIC X(5).
       01 WS-171 PIC X(5).
       01 WS-172 PIC X(5).
       01 WS-173 PIC X(5).
       01 WS-174 PIC X(5).
       01 WS-175 PIC X(5).
       01 WS-176 PIC X(5).
       01 WS-177 PIC X(5).
       01 WS-178 PIC X(5).
       01 WS-179 PIC X(5).
       01 WS-180 PIC X(5).
       01 WS-181 PIC X(5).
       01 WS-182 PIC X(5).
       01 WS-183 PIC X(5).
       01 WS-184 PIC X(5).
       01 WS-185 PIC X(5).
       01 WS-186 PIC X(5).
       01 WS-187 PIC X(5).
       01 WS-188 PIC X(5).
       01 WS-189 PIC X(5).
       01 WS-190 PIC X(5).
       01 WS-191 PIC X(5).
       01 WS-192 PIC X(5).
       01 WS-193 PIC X(5).
       01 WS-194 PIC X(5).
       01 WS-195 PIC X(5).
       01 WS-196 PIC X(5).
       01 WS-197 PIC X(5).
       01 WS-198 PIC X(5).
       01 WS-199 PIC X(5).
       01 WS-200 PIC X(5).
       01 WS-201 PIC X(5).
       01 WS-202 PIC X(5).
       01 WS-203 PIC X(5).
       01 WS-204 PIC X(5).
       01 WS-205 PIC X(5).
       01 WS-206 PIC X(5).
       01 WS-207 PIC X(5).
       01 WS-208 PIC X(5).
       01 WS-209 PIC X(5).
       01 WS-210 PIC X(5).
       01 WS-211 PIC X(5).
       01 WS-212 PIC X(5).
       01 WS-213 PIC X(5).
       01 WS-214 PIC X(5).
       01 WS-215 PIC X(5).
       01 WS-216 PIC X(5).
       01 WS-217 PIC X(5).
       01 WS-218 PIC X(5).
       01 WS-219 PIC X(5).
       01 WS-220 PIC X(5).
       01 WS-221 PIC X(5).
       01 WS-222 PIC X(5).
       01 WS-223 PIC X(5).
       01 WS-224 PIC X(5).
       01 WS-225 PIC X(5).
       01 WS-226 PIC X(5).
       01 WS-227 PIC X(5).
       01 WS-228 PIC X(5).
       01 WS-229 PIC X(5).
       01 WS-230 PIC X(5).
       01 WS-231 PIC X(5).
       01 WS-232 PIC X(5).
       01 WS-233 PIC X(5).
       01 WS-234 PIC X(5).
       01 WS-235 PIC X(5).
       01 WS-236 PIC X(5).
       01 WS-237 PIC X(5).
       01 WS-238 PIC X(5).
       01 WS-239 PIC X(5).
       01 WS-240 PIC X(5).
       01 WS-241 PIC X(5).
       01 WS-242 PIC X(5).
       01 WS-243 PIC X(5).
       01 WS-244 PIC X(5).
       01 WS-245 PIC X(5).
       01 WS-246 PIC X(5).
       01 WS-247 PIC X(5).
       01 WS-248 PIC X(5).
       01 WS-249 PIC X(5).
       01 WS-250 PIC X(5).
       01 WS-251 PIC X(5).
       01 WS-252 PIC X(5).
       01 WS-253 PIC X(5).
       01 WS-254 PIC X(5).
       01 WS-255 PIC X(5).
       01 WS-256 PIC X(5).
       01 WS-257 PIC X(5).
       01 WS-258 PIC X(5).
       01 WS-259 PIC X(5).
       01 WS-260 PIC X(5).
       01 WS-261 PIC X(5).
       01 WS-262 PIC X(5).
       01 WS-263 PIC X(5).
       01 WS-264 PIC X(5).
       01 WS-265 PIC X(5).
       01 WS-266 PIC X(5).
       01 WS-267 PIC X(5).
       01 WS-268 PIC X(5).
       01 WS-269 PIC X(5).
       01 WS-270 PIC X(5).
       01 WS-271 PIC X(5).
       01 WS-272 PIC X(5).
       01 WS-273 PIC X(5).
       01 WS-274 PIC X(5).
       01 WS-275 PIC X(5).
       01 WS-276 PIC X(5).
       01 WS-277 PIC X(5).
       01 WS-278 PIC X(5).
       01 WS-279 PIC X(5).
       01 WS-280 PIC X(5).
       01 WS-281 PIC X(5).
       01 WS-282 PIC X(5).
       01 WS-283 PIC X(5).
       01 WS-284 PIC X(5).
       01 WS-285 PIC X(5).
       01 WS-286 PIC X(5).
       01 WS-287 PIC X(5).
       01 WS-288 PIC X(5).
       01 WS-289 PIC X(5).
       01 WS-290 PIC X(5).
       01 WS-291 PIC X(5).
       01 WS-292 PIC X(5).
       01 WS-293 PIC X(5).
       01 WS-294 PIC X(5).
       01 WS-295 PIC X(5).
       01 WS-296 PIC X(5).
       01 WS-297 PIC X(5).
       01 WS-298 PIC X(5).
       01 WS-299 PIC X(5).
       01 WS-300 PIC X(5).
       01 WS-301 PIC X(5).
       01 WS-302 PIC X(5).
       01 WS-303 PIC X(5).
       01 WS-304 PIC X(5).
       01 WS-305 PIC X(5).
       01 WS-306 PIC X(5).
       01 WS-307 PIC X(5).
       01 WS-308 PIC X(5).
       01 WS-309 PIC X(5).
       01 WS-310 PIC X(5).
       01 WS-311 PIC X(5).
       01 WS-312 PIC X(5).
       01 WS-313 PIC X(5).
       01 WS-314 PIC X(5).
       01 WS-315 PIC X(5).
       01 WS-316 PIC X(5).
       01 WS-317 PIC X(5).
       01 WS-318 PIC X(5).
       01 WS-319 PIC X(5).
       01 WS-320 PIC X(5).
       01 WS-321 PIC X(5).
       01 WS-322 PIC X(5).
       01 WS-323 PIC X(5).
       01 WS-324 PIC X(5).
       01 WS-325 PIC X(5).
       01 WS-326 PIC X(5).
       01 WS-327 PIC X(5).
       01 WS-328 PIC X(5).
       01 WS-329 PIC X(5).
       01 WS-330 PIC X(5).
       01 WS-331 PIC X(5).
       01 WS-332 PIC X(5).
       01 WS-333 PIC X(5).
       01 WS-334 PIC X(5).
       01 WS-335 PIC X(5).
       01 WS-336 PIC X(5).
       01 WS-337 PIC X(5).
       01 WS-338 PIC X(5).
       01 WS-339 PIC X(5).
       01 WS-340 PIC X(5).
       01 WS-341 PIC X(5).
       01 WS-342 PIC X(5).
       01 WS-343 PIC X(5).
       01 WS-344 PIC X(5).
       01 WS-345 PIC X(5).
       01 WS-346 PIC X(5).
       01 WS-347 PIC X(5).
       01 WS-348 PIC X(5).
       01 WS-349 PIC X(5).
       01 WS-350 PIC X(5).
       01 WS-351 PIC X(5).
       01 WS-352 PIC X(5).
       01 WS-353 PIC X(5).
       01 WS-354 PIC X(5).
       01 WS-355 PIC X(5).
       01 WS-356 PIC X(5).
       01 WS-357 PIC X(5).
       01 WS-358 PIC X(5).
       01 WS-359 PIC X(5).
       01 WS-360 PIC X(5).
       01 WS-361 PIC X(5).
       01 WS-362 PIC X(5).
       01 WS-363 PIC X(5).
       01 WS-364 PIC X(5).
       01 WS-365 PIC X(5).
       01 WS-366 PIC X(5).
       01 WS-367 PIC X(5).
       01 WS-368 PIC X(5).
       01 WS-369 PIC X(5).
       01 WS-370 PIC X(5).
       01 WS-371 PIC X(5).
       01 WS-372 PIC X(5).
       01 WS-373 PIC X(5).
       01 WS-374 PIC X(5).
       01 WS-375 PIC X(5).
       01 WS-376 PIC X(5).
       01 WS-377 PIC X(5).
       01 WS-378 PIC X(5).
       01 WS-379 PIC X(5).
       01 WS-380 PIC X(5).
       01 WS-381 PIC X(5).
       01 WS-382 PIC X(5).
       01 WS-383 PIC X(5).
       01 WS-384 PIC X(5).
       01 WS-385 PIC X(5).
       01 WS-386 PIC X(5).
       01 WS-387 PIC X(5).
       01 WS-388 PIC X(5).
       01 WS-389 PIC X(5).
       01 WS-390 PIC X(5).
       01 WS-391 PIC X(5).
       01 WS-392 PIC X(5).
       01 WS-393 PIC X(5).
       01 WS-394 PIC X(5).
       01 WS-395 PIC X(5).
       01 WS-396 PIC X(5).
       01 WS-397 PIC X(5).
       01 WS-398 PIC X(5).
       01 WS-399 PIC X(5).
       PROCEDURE DIVISION.
           MOVE 'PROGA' TO WS-0.
           MOVE 'PROGA' TO WS-1.
           MOVE 'PROGA' TO WS-2.
           MOVE 'PROGA' TO WS-3.
           MOVE 'PROGA' TO WS-4.
           MOVE 'PROGA' TO WS-5.
           MOVE 'PROGA' TO WS-6.
           MOVE 'PROGA' TO WS-7.
           MOVE 'PROGA' TO WS-8.
           MOVE 'PROGA' TO WS-9.
           MOVE 'PROGA' TO WS-10.
           MOVE 'PROGA' TO WS-11.
           MOVE 'PROGA' TO WS-12.
           MOVE 'PROGA' TO WS-13.
           MOVE 'PROGA' TO WS-14.
           MOVE 'PROGA' TO WS-15.
           MOVE 'PROGA' TO WS-16.
           MOVE 'PROGA' TO WS-17.
           MOVE 'PROGA' TO WS-18.
           MOVE 'PROGA' TO WS-19.
           MOVE 'PROGA' TO WS-20.
           MOVE 'PROGA' TO WS-21.
           MOVE 'PROGA' TO WS-22.
           MOVE 'PROGA' TO WS-23.
           MOVE 'PROGA' TO WS-24.
           MOVE 'PROGA' TO WS-25.
           MOVE 'PROGA' TO WS-26.
           MOVE 'PROGA' TO WS-27.
           MOVE 'PROGA' TO WS-28.
           MOVE 'PROGA' TO WS-29.
           MOVE 'PROGA' TO WS-30.
           MOVE 'PROGA' TO WS-31.
           MOVE 'PROGA' TO WS-32.
           MOVE 'PROGA' TO WS-33.
           MOVE 'PROGA' TO WS-34.
           MOVE 'PROGA' TO WS-35.
           MOVE 'PROGA' TO WS-36.
           MOVE 'PROGA' TO WS-37.
           MOVE 'PROGA' TO WS-38.
           MOVE 'PROGA' TO WS-39.
           MOVE 'PROGA' TO WS-40.
           MOVE 'PROGA' TO WS-41.
           MOVE 'PROGA' TO WS-42.
           MOVE 'PROGA' TO WS-43.
           MOVE 'PROGA' TO WS-44.
           MOVE 'PROGA' TO WS-45.
           MOVE 'PROGA' TO WS-46.
           MOVE 'PROGA' TO WS-47.
           MOVE 'PROGA' TO WS-48.
           MOVE 'PROGA' TO WS-49.
           MOVE 'PROGA' TO WS-50.
           MOVE 'PROGA' TO WS-51.
           MOVE 'PROGA' TO WS-52.
           MOVE 'PROGA' TO WS-53.
           MOVE 'PROGA' TO WS-54.
           MOVE 'PROGA' TO WS-55.
           MOVE 'PROGA' TO WS-56.
           MOVE 'PROGA' TO WS-57.
           MOVE 'PROGA' TO WS-58.
           MOVE 'PROGA' TO WS-59.
           MOVE 'PROGA' TO WS-60.
           MOVE 'PROGA' TO WS-61.
           MOVE 'PROGA' TO WS-62.
           MOVE 'PROGA' TO WS-63.
           MOVE 'PROGA' TO WS-64.
           MOVE 'PROGA' TO WS-65.
           MOVE 'PROGA' TO WS-66.
           MOVE 'PROGA' TO WS-67.
           MOVE 'PROGA' TO WS-68.
           MOVE 'PROGA' TO WS-69.
           MOVE 'PROGA' TO WS-70.
           MOVE 'PROGA' TO WS-71.
           MOVE 'PROGA' TO WS-72.
           MOVE 'PROGA' TO WS-73.
           MOVE 'PROGA' TO WS-74.
           MOVE 'PROGA' TO WS-75.
           MOVE 'PROGA' TO WS-76.
           MOVE 'PROGA' TO WS-77.
           MOVE 'PROGA' TO WS-78.
           MOVE 'PROGA' TO WS-79.
           MOVE 'PROGA' TO WS-80.
           MOVE 'PROGA' TO WS-81.
           MOVE 'PROGA' TO WS-82.
           MOVE 'PROGA' TO WS-83.
           MOVE 'PROGA' TO WS-84.
           MOVE 'PROGA' TO WS-85.
           MOVE 'PROGA' TO WS-86.
           MOVE 'PROGA' TO WS-87.
           MOVE 'PROGA' TO WS-88.
           MOVE 'PROGA' TO WS-89.
           MOVE 'PROGA' TO WS-90.
           MOVE 'PROGA' TO WS-91.
           MOVE 'PROGA' TO WS-92.
           MOVE 'PROGA' TO WS-93.
           MOVE 'PROGA' TO WS-94.
           MOVE 'PROGA' TO WS-95.
           MOVE 'PROGA' TO WS-96.
           MOVE 'PROGA' TO WS-97.
           MOVE 'PROGA' TO WS-98.
           MOVE 'PROGA' TO WS-99.
           MOVE 'PROGA' TO WS-100.
           MOVE 'PROGA' TO WS-101.
           MOVE 'PROGA' TO WS-102.
           MOVE 'PROGA' TO WS-103.
           MOVE 'PROGA' TO WS-104.
           MOVE 'PROGA' TO WS-105.
           MOVE 'PROGA' TO WS-106.
           MOVE 'PROGA' TO WS-107.
           MOVE 'PROGA' TO WS-108.
           MOVE 'PROGA' TO WS-109.
           MOVE 'PROGA' TO WS-110.
           MOVE 'PROGA' TO WS-111.
           MOVE 'PROGA' TO WS-112.
           MOVE 'PROGA' TO WS-113.
           MOVE 'PROGA' TO WS-114.
           MOVE 'PROGA' TO WS-115.
           MOVE 'PROGA' TO WS-116.
           MOVE 'PROGA' TO WS-117.
           MOVE 'PROGA' TO WS-118.
           MOVE 'PROGA' TO WS-119.
           MOVE 'PROGA' TO WS-120.
           MOVE 'PROGA' TO WS-121.
           MOVE 'PROGA' TO WS-122.
           MOVE 'PROGA' TO WS-123.
           MOVE 'PROGA' TO WS-124.
           MOVE 'PROGA' TO WS-125.
           MOVE 'PROGA' TO WS-126.
           MOVE 'PROGA' TO WS-127.
           MOVE 'PROGA' TO WS-128.
           MOVE 'PROGA' TO WS-129.
           MOVE 'PROGA' TO WS-130.
           MOVE 'PROGA' TO WS-131.
           MOVE 'PROGA' TO WS-132.
           MOVE 'PROGA' TO WS-133.
           MOVE 'PROGA' TO WS-134.
           MOVE 'PROGA' TO WS-135.
           MOVE 'PROGA' TO WS-136.
           MOVE 'PROGA' TO WS-137.
           MOVE 'PROGA' TO WS-138.
           MOVE 'PROGA' TO WS-139.
           MOVE 'PROGA' TO WS-140.
           MOVE 'PROGA' TO WS-141.
           MOVE 'PROGA' TO WS-142.
           MOVE 'PROGA' TO WS-143.
           MOVE 'PROGA' TO WS-144.
           MOVE 'PROGA' TO WS-145.
           MOVE 'PROGA' TO WS-146.
           MOVE 'PROGA' TO WS-147.
           MOVE 'PROGA' TO WS-148.
           MOVE 'PROGA' TO WS-149.
           MOVE 'PROGA' TO WS-150.
           MOVE 'PROGA' TO WS-151.
           MOVE 'PROGA' TO WS-152.
           MOVE 'PROGA' TO WS-153.
           MOVE 'PROGA' TO WS-154.
           MOVE 'PROGA' TO WS-155.
           MOVE 'PROGA' TO WS-156.
           MOVE 'PROGA' TO WS-157.
           MOVE 'PROGA' TO WS-158.
           MOVE 'PROGA' TO WS-159.
           MOVE 'PROGA' TO WS-160.
           MOVE 'PROGA' TO WS-161.
           MOVE 'PROGA' TO WS-162.
           MOVE 'PROGA' TO WS-163.
           MOVE 'PROGA' TO WS-164.
           MOVE 'PROGA' TO WS-165.
           MOVE 'PROGA' TO WS-166.
           MOVE 'PROGA' TO WS-167.
           MOVE 'PROGA' TO WS-168.
           MOVE 'PROGA' TO WS-169.
           MOVE 'PROGA' TO WS-170.
           MOVE 'PROGA' TO WS-171.
           MOVE 'PROGA' TO WS-172.
           MOVE 'PROGA' TO WS-173.
           MOVE 'PROGA' TO WS-174.
           MOVE 'PROGA' TO WS-175.
           MOVE 'PROGA' TO WS-176.
           MOVE 'PROGA' TO WS-177.
           MOVE 'PROGA' TO WS-178.
           MOVE 'PROGA' TO WS-179.
           MOVE 'PROGA' TO WS-180.
           MOVE 'PROGA' TO WS-181.
           MOVE 'PROGA' TO WS-182.
           MOVE 'PROGA' TO WS-183.
           MOVE 'PROGA' TO WS-184.
           MOVE 'PROGA' TO WS-185.
           MOVE 'PROGA' TO WS-186.
           MOVE 'PROGA' TO WS-187.
           MOVE 'PROGA' TO WS-188.
           MOVE 'PROGA' TO WS-189.
           MOVE 'PROGA' TO WS-190.
           MOVE 'PROGA' TO WS-191.
           MOVE 'PROGA' TO WS-192.
           MOVE 'PROGA' TO WS-193.
           MOVE 'PROGA' TO WS-194.
           MOVE 'PROGA' TO WS-195.
           MOVE 'PROGA' TO WS-196.
           MOVE 'PROGA' TO WS-197.
           MOVE 'PROGA' TO WS-198.
           MOVE 'PROGA' TO WS-199.
           MOVE 'PROGA' TO WS-200.
           MOVE 'PROGA' TO WS-201.
           MOVE 'PROGA' TO WS-202.
           MOVE 'PROGA' TO WS-203.
           MOVE 'PROGA' TO WS-204.
           MOVE 'PROGA' TO WS-205.
           MOVE 'PROGA' TO WS-206.
           MOVE 'PROGA' TO WS-207.
           MOVE 'PROGA' TO WS-208.
           MOVE 'PROGA' TO WS-209.
           MOVE 'PROGA' TO WS-210.
           MOVE 'PROGA' TO WS-211.
           MOVE 'PROGA' TO WS-212.
           MOVE 'PROGA' TO WS-213.
           MOVE 'PROGA' TO WS-214.
           MOVE 'PROGA' TO WS-215.
           MOVE 'PROGA' TO WS-216.
           MOVE 'PROGA' TO WS-217.
           MOVE 'PROGA' TO WS-218.
           MOVE 'PROGA' TO WS-219.
           MOVE 'PROGA' TO WS-220.
           MOVE 'PROGA' TO WS-221.
           MOVE 'PROGA' TO WS-222.
           MOVE 'PROGA' TO WS-223.
           MOVE 'PROGA' TO WS-224.
           MOVE 'PROGA' TO WS-225.
           MOVE 'PROGA' TO WS-226.
           MOVE 'PROGA' TO WS-227.
           MOVE 'PROGA' TO WS-228.
           MOVE 'PROGA' TO WS-229.
           MOVE 'PROGA' TO WS-230.
           MOVE 'PROGA' TO WS-231.
           MOVE 'PROGA' TO WS-232.
           MOVE 'PROGA' TO WS-233.
           MOVE 'PROGA' TO WS-234.
           MOVE 'PROGA' TO WS-235.
           MOVE 'PROGA' TO WS-236.
           MOVE 'PROGA' TO WS-237.
           MOVE 'PROGA' TO WS-238.
           MOVE 'PROGA' TO WS-239.
           MOVE 'PROGA' TO WS-240.
           MOVE 'PROGA' TO WS-241.
           MOVE 'PROGA' TO WS-242.
           MOVE 'PROGA' TO WS-243.
           MOVE 'PROGA' TO WS-244.
           MOVE 'PROGA' TO WS-245.
           MOVE 'PROGA' TO WS-246.
           MOVE 'PROGA' TO WS-247.
           MOVE 'PROGA' TO WS-248.
           MOVE 'PROGA' TO WS-249.
           MOVE 'PROGA' TO WS-250.
           MOVE 'PROGA' TO WS-251.
           MOVE 'PROGA' TO WS-252.
           MOVE 'PROGA' TO WS-253.
           MOVE 'PROGA' TO WS-254.
           MOVE 'PROGA' TO WS-255.
           MOVE 'PROGA' TO WS-256.
           MOVE 'PROGA' TO WS-257.
           MOVE 'PROGA' TO WS-258.
           MOVE 'PROGA' TO WS-259.
           MOVE 'PROGA' TO WS-260.
           MOVE 'PROGA' TO WS-261.
           MOVE 'PROGA' TO WS-262.
           MOVE 'PROGA' TO WS-263.
           MOVE 'PROGA' TO WS-264.
           MOVE 'PROGA' TO WS-265.
           MOVE 'PROGA' TO WS-266.
           MOVE 'PROGA' TO WS-267.
           MOVE 'PROGA' TO WS-268.
           MOVE 'PROGA' TO WS-269.
           MOVE 'PROGA' TO WS-270.
           MOVE 'PROGA' TO WS-271.
           MOVE 'PROGA' TO WS-272.
           MOVE 'PROGA' TO WS-273.
           MOVE 'PROGA' TO WS-274.
           MOVE 'PROGA' TO WS-275.
           MOVE 'PROGA' TO WS-276.
           MOVE 'PROGA' TO WS-277.
           MOVE 'PROGA' TO WS-278.
           MOVE 'PROGA' TO WS-279.
           MOVE 'PROGA' TO WS-280.
           MOVE 'PROGA' TO WS-281.
           MOVE 'PROGA' TO WS-282.
           MOVE 'PROGA' TO WS-283.
           MOVE 'PROGA' TO WS-284.
           MOVE 'PROGA' TO WS-285.
           MOVE 'PROGA' TO WS-286.
           MOVE 'PROGA' TO WS-287.
           MOVE 'PROGA' TO WS-288.
           MOVE 'PROGA' TO WS-289.
           MOVE 'PROGA' TO WS-290.
           MOVE 'PROGA' TO WS-291.
           MOVE 'PROGA' TO WS-292.
           MOVE 'PROGA' TO WS-293.
           MOVE 'PROGA' TO WS-294.
           MOVE 'PROGA' TO WS-295.
           MOVE 'PROGA' TO WS-296.
           MOVE 'PROGA' TO WS-297.
           MOVE 'PROGA' TO WS-298.
           MOVE 'PROGA' TO WS-299.
           MOVE 'PROGA' TO WS-300.
           MOVE 'PROGA' TO WS-301.
           MOVE 'PROGA' TO WS-302.
           MOVE 'PROGA' TO WS-303.
           MOVE 'PROGA' TO WS-304.
           MOVE 'PROGA' TO WS-305.
           MOVE 'PROGA' TO WS-306.
           MOVE 'PROGA' TO WS-307.
           MOVE 'PROGA' TO WS-308.
           MOVE 'PROGA' TO WS-309.
           MOVE 'PROGA' TO WS-310.
           MOVE 'PROGA' TO WS-311.
           MOVE 'PROGA' TO WS-312.
           MOVE 'PROGA' TO WS-313.
           MOVE 'PROGA' TO WS-314.
           MOVE 'PROGA' TO WS-315.
           MOVE 'PROGA' TO WS-316.
           MOVE 'PROGA' TO WS-317.
           MOVE 'PROGA' TO WS-318.
           MOVE 'PROGA' TO WS-319.
           MOVE 'PROGA' TO WS-320.
           MOVE 'PROGA' TO WS-321.
           MOVE 'PROGA' TO WS-322.
           MOVE 'PROGA' TO WS-323.
           MOVE 'PROGA' TO WS-324.
           MOVE 'PROGA' TO WS-325.
           MOVE 'PROGA' TO WS-326.
           MOVE 'PROGA' TO WS-327.
           MOVE 'PROGA' TO WS-328.
           MOVE 'PROGA' TO WS-329.
           MOVE 'PROGA' TO WS-330.
           MOVE 'PROGA' TO WS-331.
           MOVE 'PROGA' TO WS-332.
           MOVE 'PROGA' TO WS-333.
           MOVE 'PROGA' TO WS-334.
           MOVE 'PROGA' TO WS-335.
           MOVE 'PROGA' TO WS-336.
           MOVE 'PROGA' TO WS-337.
           MOVE 'PROGA' TO WS-338.
           MOVE 'PROGA' TO WS-339.
           MOVE 'PROGA' TO WS-340.
           MOVE 'PROGA' TO WS-341.
           MOVE 'PROGA' TO WS-342.
           MOVE 'PROGA' TO WS-343.
           MOVE 'PROGA' TO WS-344.
           MOVE 'PROGA' TO WS-345.
           MOVE 'PROGA' TO WS-346.
           MOVE 'PROGA' TO WS-347.
           MOVE 'PROGA' TO WS-348.
           MOVE 'PROGA' TO WS-349.
           MOVE 'PROGA' TO WS-350.
           MOVE 'PROGA' TO WS-351.
           MOVE 'PROGA' TO WS-352.
           MOVE 'PROGA' TO WS-353.
           MOVE 'PROGA' TO WS-354.
           MOVE 'PROGA' TO WS-355.
           MOVE 'PROGA' TO WS-356.
           MOVE 'PROGA' TO WS-357.
           MOVE 'PROGA' TO WS-358.
           MOVE 'PROGA' TO WS-359.
           MOVE 'PROGA' TO WS-360.
           MOVE 'PROGA' TO WS-361.
           MOVE 'PROGA' TO WS-362.
           MOVE 'PROGA' TO WS-363.
           MOVE 'PROGA' TO WS-364.
           MOVE 'PROGA' TO WS-365.
           MOVE 'PROGA' TO WS-366.
           MOVE 'PROGA' TO WS-367.
           MOVE 'PROGA' TO WS-368.
           MOVE 'PROGA' TO WS-369.
           MOVE 'PROGA' TO WS-370.
           MOVE 'PROGA' TO WS-371.
           MOVE 'PROGA' TO WS-372.
           MOVE 'PROGA' TO WS-373.
           MOVE 'PROGA' TO WS-374.
           MOVE 'PROGA' TO WS-375.
           MOVE 'PROGA' TO WS-376.
           MOVE 'PROGA' TO WS-377.
           MOVE 'PROGA' TO WS-378.
           MOVE 'PROGA' TO WS-379.
           MOVE 'PROGA' TO WS-380.
           MOVE 'PROGA' TO WS-381.
           MOVE 'PROGA' TO WS-382.
           MOVE 'PROGA' TO WS-383.
           MOVE 'PROGA' TO WS-384.
           MOVE 'PROGA' TO WS-385.
           MOVE 'PROGA' TO WS-386.
           MOVE 'PROGA' TO WS-387.
           MOVE 'PROGA' TO WS-388.
           MOVE 'PROGA' TO WS-389.
           MOVE 'PROGA' TO WS-390.
           MOVE 'PROGA' TO WS-391.
           MOVE 'PROGA' TO WS-392.
           MOVE 'PROGA' TO WS-393.
           MOVE 'PROGA' TO WS-394.
           MOVE 'PROGA' TO WS-395.
           MOVE 'PROGA' TO WS-396.
           MOVE 'PROGA' TO WS-397.
           MOVE 'PROGA' TO WS-398.
           MOVE 'PROGA' TO WS-399.
           GOBACK.
       END PROGRAM SCALE-PRODUCTION.
